{
    "branchPrefix": "renovate-",
    "branchPrefixOld": "renovate-",
    "branchNameStrict": true,
    "dependencyDashboard": true,
        "description": [
        "Notes:",
        "- We are ignoring artifactErrors because it was complaining about not being able to find some of our private package, and so blocking merges. However, we already knew that a lot of our packages renovate won't be able to find because we have to manually add each one to a white list. And we couldn't find any other readily available documentation on what other kind of artifact errors it could find"
    ],
    "extends": [
        "config:base",
        "github>CenterEdge/renovate-config//phoenix/major",
        "github>CenterEdge/renovate-config//phoenix/npm-minor",
        "github>CenterEdge/renovate-config//phoenix/nuget-minor",
        "github>CenterEdge/renovate-config//phoenix/private-packages"
    ],    
    "ignorePaths": [],
    "ignoreUnstable": true,
    "packageRules": [
        {
            "matchManagers": ["dockerfile", "docker-compose", "github-actions", "kustomize"],
            "enabled": false      
        }         
    ],
    "prBodyNotes": [
        "@CenterEdge engineers:",
        "- Each PR needs a jira ticket, example ticket to copy from: https://centeredge.atlassian.net/browse/PHNX-10079 (TODO JIRA)",
        "- If a package is responsible for a regression (or for any reason a package should be excluded from a PR): ",
        "1. Add a line to the renovate config to exclude problematic package versions, such as: ```\"packageRules\": [{\"matchPackageNames\": [\"Google.Protobuf\"],\"allowedVersions\": \"<=3.11.2\"}]```",
        "2. Do not simply remove the package in this PR, see step 1. Because, if the package is manually removed from the PR without doing step 1 then when Renovate executes on this repo, then the package will automatically be added back by Renovate",
        "3. Manualy remove the package from this auto generated PR then make a Jira ticket in https://centeredge.atlassian.net/browse/PHNX-9276 to only update that package",
        "- If any single packages aren't passing the [stabilityDays](https://docs.renovatebot.com/configuration-options/#stabilitydays) check then the entire PR containing other packages will not be made (ideally just that one package would be excluded, but this is a limitation of the current system). Search \"stability\" in the [Renovate logs](https://app.renovatebot.com/dashboard#github/CenterEdge/TempPackageManagerConcept) to find which package is being blocked",
        "- Our Renovate configurations are in https://github.com/CenterEdge/renovate-config"
    ],
    "schedule": ["before 4am on Monday"],
    "suppressNotifications": ["artifactErrors"],
    "timezone": "America/New_York"
}
